testCases/04_CFD-DEM/03_glitter_and_impeller_2D/Allrun
#!/bin/sh
. $WM_PROJECT_DIR/bin/tools/RunFunctions

rm -rf 0

cp -r 0.org 0

paraFoam -touch
paraFoam -builtin -touch

runApplication blockMesh

application=`getApplication`

runApplication $application


# ----------------------------------------------------------------- end-of-file
