testCases/04_CFD-DEM/03_glitter_and_impeller_2D/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2412                                 |
|   \  /    A nd           | Web:      www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
bodyNames ("impeller_scaled" "glitter_SC_TR1" "glitter_SC_TR2" "glitter_SC_TR3" "glitter_SC_TR4" "glitter_SC_TR6" "glitter_SC_TR7");

interpolationSchemes
{
  U cell;
}

surfaceThreshold    1e-4;
stepDEM     0.01;
geometricD (1 1 -1);
recordSimulation true;
recordFirstTimeStep false;
nSolidsInDomain -1;       //Sets Upper Limit On Number Of Particles In Domain if not spcecified sets to 1000 by default


outputSetup
{
    basic true;
    iB  false;
    DEM false;
    addModel false;
    parallelDEM false;
}

DEM
{
    LcCoeff 4.0;
	rotationModel mindlin1953;
    materials
    {
        particle
        {
            Y       5e7;
            nu      0;
            mu      0.1;
            adhN    0;
            eps     1;
        }

        wall
        {
            Y       1e7;
            nu      0;
            mu      0.1;
            adhN    0;
            eps     0.5;
        }
    }

    collisionPatches
    {
		bottom
		{
			material wall;
			nVec (0.0 -1 0.0);
			planePoint (0 -0.03 0);
		}

		top
		{
			material wall;
			nVec (0.0 1 0.0);
			planePoint (0 0.03 0);
		}

		right
		{
			material wall;
			nVec (1 0.0 0.0);
			planePoint (0.03 0 0);
		}

		left
		{
			material wall;
			nVec (-1 0.0 0.0);
			planePoint (-0.03 0 0);
		}

		// front
		// {
		// 	material wall;
		// 	nVec (0.0 0.0 1);
		// 	planePoint (0 0 0.01);
		// }

		// back
		// {
		// 	material wall;
        //     nVec (0.0 0.0 -1);
        //     planePoint (0 0 -0.01);
		// }
    }
}

virtualMesh
{
    level 3;
    charCellSize 0.001;
}

impeller_scaled
{
    prescribedTransRotBody
    {
        velocity (0 0 0);
        omega 6.28;
        axis (0 0 1);
    }

    rho         rho [1 -3 0 0 0 0 0] 2500;
    material particle;
    
    bodyGeom nonConvex;
    updateTorque false;

    U
    {
        BC  noSlip;
    }

    sdBasedLambda false;
    interfaceSpan 1.0;
    startSynced false;
    refineBuffers -1;
    timesToSetStatic -1; //number of timeSteps in contact with wall/static body to set body as static. Never when -1
    bodyAddition
    {
        addModel once;
        onceCoeffs{}
    }
    material particle;
}

 glitter_SC_TR1
{
    fullyCoupledBody
    {
        velocity (0 0.1 0);
    }


    rho         rho [1 -3 0 0 0 0 0] 2500;
    material particle;
    
    bodyGeom convex;

    U
    {
        BC  noSlip;
    }

    updateTorque true;
    // updateTorque false;

    sdBasedLambda false;
    interfaceSpan 1.0;
    startSynced false;
    refineBuffers -1;
    timesToSetStatic -1; //number of timeSteps in contact with wall/static body to set body as static. Never when -1
    bodyAddition
    {
        addModel once;
        onceCoeffs{}
    }
    material particle;
}


 glitter_SC_TR2
{
    fullyCoupledBody
    {
        velocity (0 0.1 0);
    }


    rho         rho [1 -3 0 0 0 0 0] 2500;
    material particle;
    
    bodyGeom convex;

    U
    {
        BC  noSlip;
    }

    updateTorque true;
    // updateTorque false;

    sdBasedLambda false;
    interfaceSpan 1.0;
    startSynced false;
    refineBuffers -1;
    timesToSetStatic -1; //number of timeSteps in contact with wall/static body to set body as static. Never when -1
    bodyAddition
    {
        addModel once;
        onceCoeffs{}
    }
    material particle;
}


 glitter_SC_TR3
{
    fullyCoupledBody
    {
        velocity (0 0.1 0);
    }


    rho         rho [1 -3 0 0 0 0 0] 2500;
    material particle;
    
    bodyGeom convex;

    U
    {
        BC  noSlip;
    }

    updateTorque true;
    // updateTorque false;

    sdBasedLambda false;
    interfaceSpan 1.0;
    startSynced false;
    refineBuffers -1;
    timesToSetStatic -1; //number of timeSteps in contact with wall/static body to set body as static. Never when -1
    bodyAddition
    {
        addModel once;
        onceCoeffs{}
    }
    material particle;
}


 glitter_SC_TR4
{
    fullyCoupledBody
    {
        velocity (0 0.1 0);
    }


    rho         rho [1 -3 0 0 0 0 0] 2500;
    material particle;
    
    bodyGeom convex;

    U
    {
        BC  noSlip;
    }

    updateTorque true;
    // updateTorque false;

    sdBasedLambda false;
    interfaceSpan 1.0;
    startSynced false;
    refineBuffers -1;
    timesToSetStatic -1; //number of timeSteps in contact with wall/static body to set body as static. Never when -1
    bodyAddition
    {
        addModel once;
        onceCoeffs{}
    }
    material particle;
}


 glitter_SC_TR5
{
    fullyCoupledBody
    {
        velocity (0 0.1 0);
    }


    rho         rho [1 -3 0 0 0 0 0] 2500;
    material particle;
    
    bodyGeom convex;

    U
    {
        BC  noSlip;
    }

    updateTorque true;
    // updateTorque false;

    sdBasedLambda false;
    interfaceSpan 1.0;
    startSynced false;
    refineBuffers -1;
    timesToSetStatic -1; //number of timeSteps in contact with wall/static body to set body as static. Never when -1
    bodyAddition
    {
        addModel once;
        onceCoeffs{}
    }
    material particle;
}


 glitter_SC_TR6
{
    fullyCoupledBody
    {
        velocity (0 0.1 0);
    }


    rho         rho [1 -3 0 0 0 0 0] 2500;
    material particle;
    
    bodyGeom convex;

    U
    {
        BC  noSlip;
    }

    updateTorque true;
    // updateTorque false;

    sdBasedLambda false;
    interfaceSpan 1.0;
    startSynced false;
    refineBuffers -1;
    timesToSetStatic -1; //number of timeSteps in contact with wall/static body to set body as static. Never when -1
    bodyAddition
    {
        addModel once;
        onceCoeffs{}
    }
    material particle;
}


 glitter_SC_TR7
{
    fullyCoupledBody
    {
        velocity (0 0.1 0);
    }


    rho         rho [1 -3 0 0 0 0 0] 2500;
    material particle;
    
    bodyGeom convex;

    U
    {
        BC  noSlip;
    }

    updateTorque true;
    // updateTorque false;

    sdBasedLambda false;
    interfaceSpan 1.0;
    startSynced false;
    refineBuffers -1;
    timesToSetStatic -1; //number of timeSteps in contact with wall/static body to set body as static. Never when -1
    bodyAddition
    {
        addModel once;
        onceCoeffs{}
    }
    material particle;
}
// ************************************************************************* //
