testCases/04_CFD-DEM/03_glitter_and_impeller_2D/constant/bodiesFromFile.txt
glitters/1.stl
glitters/2.stl
glitters/3.stl
glitters/4.stl
glitters/5.stl
glitters/6.stl
glitters/7.stl
glitters/8.stl
glitters/9.stl
